{
  "title": "Advanced Semiconductor Packaging: Where Do Malaysian Firms Stand?",
  "date": "2025-11-26",
  "tags": ["semiconductors", "packaging", "Malaysia", "industry analysis"],
  "summary": "Word-for-word conversion of the article on advanced semiconductor packaging and Malaysian firms.",
  "content": [
    { "type": "p", "text": "The semiconductor industry had always fascinated me with its many technical complexities. In my opinion, the technology, i.e., process knowledge, intellectual properties surrounding semiconductors is the most important human invention in the modern era." },
    { "type": "p", "text": "We are bombarded by news outlets and FinTwit hyping up firms like NVIDIA and Broadcom, fabless design firms which own and design some of the most advanced IPs within the industry, supplying key products like the GPU and ASICs which form the backbone of the computing era, as well as humanity’s venture into AGI." },
    { "type": "p", "text": "However, an area that fascinates me more is with regard to the manufacturing process of semiconductors themselves. We hear of firms like TSMC dominating the wafer fabrication segment, but there is also an entire labyrinth of less well-known firms involved in the most cutting-edge solutions that enable an engineering process which brings these semiconductors to life." },
    { "type": "p", "text": "That area is in relation to semiconductor packaging, a less well-known part of the semiconductor value chain due to its sometimes-archaic terms and complexity." },

    { "type": "h3", "text": "What is semiconductor packaging?" },
    { "type": "p", "text": "First, let’s break down semiconductor packaging." },
    { "type": "p", "text": "Semiconductor packaging refers to the manufacturing and assembly of packaging components surrounding a silicon die (Integrated Circuit, or IC for short) that enables its use in circuitry while ensuring that the IC’s performance and reliability are not compromised." },
    { "type": "p", "text": "The package’s core purpose is to act as an electrical interface between the IC and the outer circuitry, as it can adapt to different sizes and scales of the metal connections located on the IC. This allows for better signal transmission quality between the IC and the outer circuitry (the PCB). Additionally, the package serves as a physical protective layer for the IC, with the die typically being encapsulated by either epoxy or some form of metal lid." },
    { "type": "p", "text": "Packages are also used to dissipate heat, given that complex ICs produce a butt-load of heat that can damage the die. Typically, within the package itself, a thermal interface material is deposited above the die, while the package itself is made out of a thermally conductive encapsulation layer to allow for efficient heat dissipation." },
    { "type": "p", "text": "As packaging technology evolved, complex architectures such as multi-die packages have been deployed to increase both the compute and functionality of the final product. Advanced packaging techniques allow for the flexibility in connecting multiple ICs to the outer circuitry." },

    { "type": "h3", "text": "How many types of packaging are there?" },
    { "type": "p", "text": "It is important to distinguish the two main types of packaging that we will discuss here. The first relates to the different techniques used to package the silicon die to the interposer, and the second involves the different forms that a packaging solution can take." },

    { "type": "h3", "text": "The first type: die-to-interposer packaging techniques" },
    { "type": "p", "text": "During fabrication, chemical and laser etchings expose electrical connections on top of the die, and these connections can be used to connect to the interposer via two standard means:" },
    { "type": "list", "ordered": false, "items": [
      "Wire bond: ultra-thin gold wires are connected to bond pads located on the die to metal traces of the interposer. >80% of ICs use wire bonds.",
      "Flip Chip: solder balls are bonded on the top of the die, and the die is then inverted and bonded to metal pads of the interposer.",
      "Through Silicon Vias (TSV): involves a technique with metal pillars called “vias” running through the dies. These vias electrically connects the die and bonds to the interposer. This technique allows for the stacking of multiple ICs on a single interposer, increasing overall computational capacity on a single chip."
    ]},

    { "type": "h3", "text": "The second type: differing forms of packaging technologies" },
    { "type": "p", "text": "I will attempt to give a high-level context of the commonly used packaging technologies deployed today, from the most basic to the most advanced forms:" },
    { "type": "list", "ordered": false, "items": [
      "Quad Flat Package (QFP): A flat, square or rectangular package with leads producing from all four sides, with pins arranged in a grid pattern. They are commonly used for ICs that require moderate pins and are relatively less computationally intensive, such as automotive chips.",
      "Ball Grid Array (BGA): Features an array of solder balls located on the underside of the package which contact with the corresponding pads on the PCB. Widely used in modern electronics due to its compact architecture, excellent heat dissipation ability and high structural integrity.",
      "Wafer-Level Packaging (WLP): A chip-scale packaging technique which involves the packaging of multiple ICs on whole wafers, with the wafers being diced only after the packaging is successfully completed. This technique allows for the integration of wafer fabrication, testing and packaging at the wafer level, resulting in a more streamlined manufacturing process, reducing overall cost per chip.",
      "WLP is currently the smallest available packaging technology in the market and presents an economical way to achieve high interconnect densities within compact spaces. This translates to a wider available range of form factors for the finished package with improved performance. WLP are frequently applied in the mobile device market as packaging miniaturisation became an important factor.",
      "There are two kinds of WLP, and they are Fan-In WLP (FIWLP) and Fan-Out WLP (FOWLP), with key differences being at the interposer level. For FIWLP, both the die and the interposer (or redistribution layer, RDL for short) are of the same size as the RDL and encapsulation layer are applied directly on the fabricated wafer and then diced right after to get the finished package.",
      "Conversely, FOWLP involves dicing the ICs and reconstituting them on a new wafer first, before both RDL and encapsulation is done. FOWLP typically involves having the interposer / RDL being larger than the die itself. The extra step is used to ensure there is additional space left for the interconnects.",
      "System-in-Package (SiP): An advanced packaging approach where multiple ICs (logic, memory, RF, sensors) are integrated into a single package, with the goal of achieving miniaturisation and functional integration. These ICs are often connected via wire-bond, flip chip or FOWLP. SiP essentially encompasses a broad category of “many dies in one package”.",
      "2.5D / 3D Integration: Involves stacking multiple dies on top of each other within a single package through the use of TSVs (as discussed earlier). This technology allows for better integration, reduced signal delays, and enhanced performance. Commonly used in HPC, GPUs and memory modules which are require largely amounts of compute and memory. 2.5D integration places the dies side-by-side on an interposer, while 3D integration stacks chips vertically. 3D offers higher performance due to shorter connections, but 2.5D is often easier to manage and more cost-effective for certain applications.",
      "Chiplets / Heterogeneous Integration: A more advanced form of multi-die integration where large monolithic chips are broken into smaller “chiplets” (logic, I/O, memory, analog) and then re-integrated in a package through advanced interconnects such as the 2.5D / 3D integration or hybrid bonding. Perhaps the most important difference between SiP and chiplets are with regard to the architectural design, such that chiplets are broken and then re-integrated, and the flexibility for mixing of different process nodes under the chiplet architecture."
    ]},

    { "type": "h3", "text": "How Big is the OSAT market and who are the dominant players?" },
    { "type": "p", "text": "At what stages are these dominant players at?" },

    { "type": "h3", "text": "Why is semiconductor packaging so important anyway?" },
    { "type": "p", "text": "Moore’s Law, Packaging techniques deployed to optimise compute" },

    { "type": "h3", "text": "Malaysian Firms vs. Global Leading OSAT / Packaging Players" },
    { "type": "h3", "text": "Are the valuations of these Malaysian Firms involved in semiconductor packaging even justified?" }
}
